{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up"],
     "responses": ["Hello!", "Good to see you again!", "Hi there, how can I help?"],
     "context_set": ""
    },
    {"tag": "player",
     "patterns": ["Who is the best player", "Goat of soccer", "Goat of football", "Best striker", "Who is the most decorated", "Greatest player in history"],
     "responses": ["Messi", "Lionel Messi is the best"],
     "context_set": ""
    },
    {"tag": "goodbye",
     "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day"],
     "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
     "context_set": ""
    },
    {"tag": "age",
     "patterns": ["how old", "how old are you", "what is your age", "how old are you", "age?"],
     "responses": ["I don't have an age, I am a chatbot"],
     "context_set": ""
    },
    {"tag": "name",
     "patterns": ["what is your name", "what should I call you", "whats your name?"],
     "responses": ["You can call me Ahmad", "I'm Ahmad!", "Call me Ahmad"],
     "context_set": ""
    },
    {"tag": "offside",
     "patterns": ["What is offside", "In soccer why do goals get disallowed", "Tell me about the offside rule", "In football why do goals get disallowed"],
     "responses": ["There is an offside rule in soccer that ensures no player is behind the last defender of the other team", "There is an offside rule in soccer that ensures no player is behind the last defender of the other team"],
     "context_set": ""
    },
    {"tag": "soccer_yellow_card",
     "patterns": ["What does a yellow card mean in soccer", "Explain the significance of a yellow card", "Tell me about the yellow card rule"],
     "responses": ["A yellow card is shown to a player as a caution, typically for a reckless or dangerous foul.", "In soccer, a yellow card is a disciplinary action used by referees to penalize misconduct."],
     "context_set": ""
    },
    
    {"tag": "soccer_red_card",
     "patterns": ["What does a red card mean in soccer", "Explain the significance of a red card", "Tell me about the red card rule"],
     "responses": ["A red card is a more severe disciplinary action, leading to a player being sent off the field for serious misconduct.", "In soccer, a red card indicates a player's ejection from the match due to a serious offense."],
     "context_set": ""
    },
    
    {"tag": "soccer_free_kick",
     "patterns": ["How does a free kick work in soccer", "Explain the rules of a free kick", "Tell me about taking a free kick in football"],
     "responses": ["A free kick is awarded to a team following a foul, and opponents must maintain a required distance until the kick is taken.", "In soccer, a free kick allows a team to restart play from the location where the foul occurred."],
     "context_set": ""
    },
    
    {"tag": "soccer_penalty_kick",
     "patterns": ["How does a penalty kick work in soccer", "Explain the rules of a penalty kick", "Tell me about taking a penalty kick in football"],
     "responses": ["A penalty kick is awarded after a major foul, and it is taken from the penalty spot with only the goalkeeper defending.", "In soccer, a penalty kick is a direct free kick awarded to the attacking team when a foul occurs inside the opponent's penalty area."],
     "context_set": ""
    },
    
    {"tag": "soccer_throw_in",
     "patterns": ["How does a throw-in work in soccer", "Explain the rules of a throw-in", "Tell me about taking a throw-in in football"],
     "responses": ["A throw-in is awarded when the ball goes out of bounds, and it must be taken with both hands from behind the head.", "In soccer, a throw-in is a method of restarting play, and the player must have both feet on or behind the touchline when making the throw."],
     "context_set": ""
    },
    
    {"tag": "soccer_goal_kick",
     "patterns": ["How does a goal kick work in soccer", "Explain the rules of a goal kick", "Tell me about taking a goal kick in football"],
     "responses": ["A goal kick is awarded when the attacking team last touches the ball before it goes out of bounds over the goal line.", "In soccer, a goal kick allows the defending team to restart play from their own goal area."],
     "context_set": ""
    },
    
    {"tag": "soccer_corner_kick",
     "patterns": ["How does a corner kick work in soccer", "Explain the rules of a corner kick", "Tell me about taking a corner kick in football"],
     "responses": ["A corner kick is awarded when the defending team puts the ball out of play over their own goal line.", "In soccer, a corner kick allows the attacking team to restart play from the corner of the field."],
     "context_set": ""
    },
    
    {"tag": "soccer_own_goal",
     "patterns": ["What is an own goal in soccer", "Explain the concept of an own goal", "Tell me about scoring an own goal in football"],
     "responses": ["An own goal occurs when a player unintentionally scores a goal for the opposing team.", "In soccer, an own goal is credited to the attacking team when a defender or goalkeeper scores in their own net."],
     "context_set": ""
    },
    
    {"tag": "soccer_hattrick",
     "patterns": ["What is a hattrick in soccer", "Explain the concept of a hattrick", "Tell me about scoring a hattrick in football"],
     "responses": ["A hattrick is achieved when a player scores three goals in a single match.", "In soccer, a hattrick is a remarkable individual achievement and is celebrated when a player scores three goals in a game."],
     "context_set": ""
    },
    
    {"tag": "soccer_positions",
     "patterns": ["Explain soccer positions", "Tell me about player positions in soccer", "What are the different soccer positions"],
     "responses": ["Soccer positions include forward, midfielder, defender, and goalkeeper, each with specific roles on the field.", "In soccer, player positions are categorized based on their role in the team, such as forwards who focus on scoring goals and goalkeepers who defend the goalpost."],
     "context_set": ""
    },
    
    {"tag": "soccer_world_cup",
     "patterns": ["Tell me about the FIFA World Cup", "Explain the history of the World Cup", "What is the significance of the World Cup in soccer"],
     "responses": ["The FIFA World Cup is an international soccer competition held every four years, featuring teams from around the world.", "The World Cup is the premier tournament in soccer, showcasing the best national teams and creating moments of global excitement."],
     "context_set": ""
    },
    
    {"tag": "soccer_champions_league",
     "patterns": ["Explain the UEFA Champions League", "Tell me about the Champions League in soccer", "What is the format of the Champions League"],
     "responses": ["The UEFA Champions League is a prestigious club competition in European soccer, featuring top clubs from various leagues.", "The Champions League is known for its knockout stages and final, where the best club teams compete for the coveted title."],
     "context_set": ""
    },
    
    {"tag": "soccer_ball",
     "patterns": ["Tell me about the soccer ball", "What is the standard size of a soccer ball", "Explain the design of a soccer ball"],
     "responses": ["A soccer ball is typically made of leather or synthetic materials and has a standard size and weight defined by regulations.", "The design of a soccer ball includes panels stitched together, and its size and weight are standardized for official matches."],
     "context_set": ""
    },
    
    {"tag": "soccer_trophies",
     "patterns": ["What are the major trophies in soccer", "Tell me about soccer trophies", "Explain the significance of soccer awards"],
     "responses": ["Major soccer trophies include the FIFA World Cup, UEFA Champions League, and domestic league titles.", "Soccer trophies symbolize achievements in various competitions, with each trophy carrying its own historical and cultural significance."],
     "context_set": ""
    },
    
    {"tag": "soccer_stadiums",
     "patterns": ["Explain soccer stadiums", "Tell me about iconic soccer stadiums", "What is the largest soccer stadium"],
     "responses": ["Soccer stadiums vary in size and architecture, with iconic venues like Camp Nou and Old Trafford having rich histories.", "The largest soccer stadium is Rungrado May Day Stadium in North Korea, with a capacity exceeding 100,000 spectators."],
     "context_set": ""
    },
    
    {"tag": "soccer_clubs",
     "patterns": ["Tell me about famous soccer clubs", "Explain the history of top soccer clubs", "What are the most successful soccer clubs"],
     "responses": ["Famous soccer clubs include FC Barcelona, Real Madrid, and Manchester United, with rich histories and global fanbases.", "The most successful soccer clubs have won numerous domestic league titles and international competitions, establishing their prominence in the soccer world."],
     "context_set": ""
    },
    
    {"tag": "soccer_var",
     "patterns": ["What is Video Assistant Referee (VAR) in soccer", "Explain the role of VAR in football", "Tell me about the use of VAR in soccer"],
     "responses": ["VAR is a technology used in soccer to review on-field decisions and correct clear errors, enhancing the accuracy of officiating.", "The Video Assistant Referee (VAR) system is employed to ensure fair play and minimize controversial decisions in soccer matches."],
     "context_set": ""
    },
    {"tag": "soccer_legends",
     "patterns": ["Who are soccer legends", "Tell me about iconic soccer players", "Name some soccer legends"],
     "responses": ["Soccer legends include Pelé, Diego Maradona, and Johan Cruyff, celebrated for their exceptional skills and contributions to the sport.", "Iconic soccer players like Ronaldo, Zinedine Zidane, and George Best are considered legends for their remarkable performances and impact on the game."],
     "context_set": ""
    },
    
    {"tag": "soccer_nations",
     "patterns": ["Which country is the best in soccer", "Tell me about top soccer nations", "Name the strongest soccer national teams"],
     "responses": ["Countries like Brazil, Germany, and Argentina are traditionally strong in soccer, boasting successful national teams with multiple achievements.", "Soccer powerhouses include Spain, Italy, and the Netherlands, known for their rich soccer history and competitive national squads."],
     "context_set": ""
    },
    
    {"tag": "soccer_transfers",
     "patterns": ["Explain soccer transfers", "Tell me about player transfers in soccer", "What is the transfer window in football"],
     "responses": ["Soccer transfers involve players moving from one club to another, often for a transfer fee, during designated transfer windows.", "The transfer window is a specific period when clubs can buy or sell players, typically occurring in the summer and winter seasons."],
     "context_set": ""
    },
    
    {"tag": "soccer_rivalries",
     "patterns": ["Tell me about soccer rivalries", "Explain famous soccer rivalries", "What are the biggest rivalries in football"],
     "responses": ["Soccer rivalries, like El Clásico (Barcelona vs. Real Madrid) and the North West Derby (Liverpool vs. Manchester United), are intense matchups with historical significance.", "Famous football rivalries include the Old Firm (Celtic vs. Rangers) and the Milan Derby (AC Milan vs. Inter Milan), known for passionate fan engagement."],
     "context_set": ""
    },
    
    {"tag": "soccer_records",
     "patterns": ["What are soccer records", "Tell me about football records", "Explain the most significant soccer achievements"],
     "responses": ["Soccer records include the most goals in a single season, fastest hat-tricks, and longest unbeaten runs, showcasing remarkable achievements in the sport.", "Individual records, such as most appearances and top goal-scorers, highlight the exceptional talents and longevity of certain players in soccer history."],
     "context_set": ""
    },
    
    {"tag": "soccer_womens_soccer",
     "patterns": ["Tell me about women's soccer", "Explain the history of women's soccer", "Who are the top women's soccer teams"],
     "responses": ["Women's soccer has grown in popularity, with countries like the United States, Germany, and Norway dominating on the international stage.", "The history of women's soccer includes the FIFA Women's World Cup, where teams like the USA, Brazil, and Japan have achieved success and showcased the development of the women's game."],
     "context_set": ""
    },
    
    {"tag": "soccer_goals",
     "patterns": ["What makes a great soccer goal", "Tell me about the best goals in soccer history", "Explain goal-scoring techniques in football"],
     "responses": ["Great soccer goals involve skillful dribbling, precise passing, and powerful shots, often accompanied by strategic positioning and teamwork.", "Memorable goals in soccer history include long-range strikes, bicycle kicks, and stunning volleys, highlighting the creativity and athleticism of players."],
     "context_set": ""
    },
    
    {"tag": "soccer_fouls",
     "patterns": ["Explain soccer fouls", "Tell me about common fouls in football", "What constitutes a foul in soccer"],
     "responses": ["Soccer fouls include actions like tripping, pushing, and handball, resulting in free kicks or penalty kicks for the opposing team.", "Common fouls in football involve reckless tackles, holding, and unsporting behavior, with referees enforcing rules to maintain fair play on the field."],
     "context_set": ""
    },
    {"tag": "soccer_referees",
     "patterns": ["What is the role of soccer referees", "Tell me about refereeing in football", "Explain the responsibilities of soccer officials"],
     "responses": ["Soccer referees enforce the rules, make on-field decisions, and ensure fair play during matches, with assistance from assistant referees and video technology.", "Referees in football have the authority to issue yellow and red cards, award free kicks and penalties, and maintain order on the field to uphold the integrity of the game."],
     "context_set": ""
    },
    
    {"tag": "soccer_fans",
     "patterns": ["Tell me about soccer fans", "Explain fan culture in football", "What makes soccer fans passionate"],
     "responses": ["Soccer fans are known for their passion, loyalty, and vibrant support, creating an atmosphere that enhances the excitement of matches.", "Fan culture in football includes chants, songs, and traditions that contribute to the unique and spirited experience of attending or watching soccer games."],
     "context_set": ""
    }
]
}
